In [2]:
import pandas as pd

In [3]:
data1 = pd.read_excel(r"C:\Users\ketki\OneDrive\Desktop\excel\data_3.xlsx")

In [4]:
data1

    ID     Name Department  Age  Salary       City  Experience_Years
0    1    Alice         HR   25   45000   New York                 2
1    2      Bob         IT   30   60000  San Diego                 5
2    3  Charlie    Finance   28   55000    Chicago                 3
3    4    David         IT   35   75000   New York                 7
4    5     Emma         HR   29   48000     Boston                 3
5    6    Frank  Marketing   33   52000     Denver                 4
6    7    Grace    Finance   27   53000      Miami                 2
7    8    Henry         IT   31   68000    Seattle                 6
8    9    Irene  Marketing   26   47000    Chicago                 1
9   10     Jack    Finance   40   82000     Boston                10
10  11    Kelly         HR   24   42000   New York                 1
11  12     Liam         IT   37   79000    Seattle                 8
12  13      Mia    Finance   29   56000      Miami                 3
13  14     Noah         HR   32   51000     Denver                 6
14  15   Olivia  Marketing   36   67000    Chicago                 9
15  16    Peter         IT   41   90000     Boston                12
16  17  Queenie         HR   27   46000  San Diego                 2
17  18   Robert    Finance   34   73000   New York                 7
18  19    Sarah         IT   30   64000      Miami                 5
19  20      Tom  Marketing   28   50000     Denver                 3

In [6]:
d_1 = data1[data1["Department"]=="IT"]

In [7]:
d_1

    ID   Name Department  Age  Salary       City  Experience_Years
1    2    Bob         IT   30   60000  San Diego                 5
3    4  David         IT   35   75000   New York                 7
7    8  Henry         IT   31   68000    Seattle                 6
11  12   Liam         IT   37   79000    Seattle                 8
15  16  Peter         IT   41   90000     Boston                12
18  19  Sarah         IT   30   64000      Miami                 5

In [9]:
d_2 = data1[data1["City"]=="New York"]

In [10]:
d_2

    ID    Name Department  Age  Salary      City  Experience_Years
0    1   Alice         HR   25   45000  New York                 2
3    4   David         IT   35   75000  New York                 7
10  11   Kelly         HR   24   42000  New York                 1
17  18  Robert    Finance   34   73000  New York                 7

In [11]:
d_3 = data1[data1["Age"]< 25]

In [12]:
d_3

    ID   Name Department  Age  Salary      City  Experience_Years
10  11  Kelly         HR   24   42000  New York                 1

In [18]:
d_4 = data1[(data1["Salary"]>50000) & (data1["Salary"]<60000)]

In [19]:
d_4

    ID     Name Department  Age  Salary     City  Experience_Years
2    3  Charlie    Finance   28   55000  Chicago                 3
5    6    Frank  Marketing   33   52000   Denver                 4
6    7    Grace    Finance   27   53000    Miami                 2
12  13      Mia    Finance   29   56000    Miami                 3
13  14     Noah         HR   32   51000   Denver                 6

In [22]:
d_5 = data1.groupby("Department")["Salary"].mean()

In [23]:
d_5

Department
Finance      63800.000000
HR           46400.000000
IT           72666.666667
Marketing    54000.000000
Name: Salary, dtype: float64

In [24]:
d_6 = data1.groupby("City")["Name"].count()

In [25]:
d_6

City
Boston       3
Chicago      3
Denver       3
Miami        3
New York     4
San Diego    2
Seattle      2
Name: Name, dtype: int64